import matplotlib.pyplot as plt
import numpy as np
from matplotlib.ticker import FuncFormatter


def first_image():
    y = '''Айет  2827558.4344
    Бар  1245705.5
    Шахрисабз  674928.44
    Шри-Ланка  500389.76611111115
    Хива  455874.1208333333
    Шотландия  419206.1722727273
    Жолква  409405.14999999997
    Добромиль  409405.14999999997
    Моршин  409405.14999999997
    Винники  409405.14999999997
    Золочев  409405.14999999997
    Дубляны  409405.14999999997
    Глиняны  409405.14999999997
    Жидачов  409405.14999999997
    Виноградное  402733.5
    Япония  392769.2037050363
    Бельгия  390010.59810344817
    Германия  386274.3360772408
    Мальта  354148.2835714286
    ЮАР  349530.4596666667
    Египет  334580.9492857143
    Алжир  333624.88877931033
    Калинковичи  332217.1610220455
    Текели  316027.53116666665
    Албания  312466.75573529414
    Финляндия  307175.32678819436
    Афганистан  306467.21937500004
    Швеция  296587.66029139794
    Липовец  296279.6
    Андорра  295783.85722222226
    Великобритания  289012.69109797303
    Ирландия  283398.26199425285
    Красноград  282080.0
    Старобельск  279840.715
    Австрия  277770.4026593221
    Бангладеш  276944.2928947369
    Дания  276720.49842857145
    Черногория  276130.10247499996
    Канада  275527.3005670103
    Словения  270134.8225'''

    data = y.replace('\n', ' ').split()
    x = data[::2]
    y = list(map(float, data[1::2]))

    fig, ax = plt.subplots()

    ax.bar(x, y, label='Уровень зарплат', color='black')
    ax.set_xlabel('Города и страны')
    ax.set_ylabel('Уровень зарплат, руб.')
    ax.set_title('Уровень зарплат в различных городах и странах')
    ax.legend()

    # Изменяем масштаб надписей оси x и уменьшаем шрифт
    plt.xticks(rotation=90, fontsize=5)

    # Устанавливаем деления по оси y
    def y_formatter(x, pos):
        return f'{int(x):,}'.replace(',', ' ')

    ax.yaxis.set_major_formatter(FuncFormatter(y_formatter))
    y_ticks = np.arange(0, max(y) + 300000, 300000)
    plt.yticks(y_ticks, fontsize=6)

    # Сохраняем график в файл
    plt.savefig('demand_uroven_zarplat_po_gorodam.png', format='png', dpi=300)

    plt.show()


def second_image():
    y = '''Москва  14.393454178873128
    Санкт-Петербург  5.295408981175838
    Новосибирск  1.2650820059399512
    Екатеринбург  1.2142822853778918
    Минск  1.212055751153692
    Казань  1.0938441539738424
    Нижний-Новгород  1.076837222346445
    Краснодар  0.8997724829425371
    Алматы  0.8854973982710725
    Ростов-на-Дону  0.8385033142198792
    Воронеж  0.7370302012786939
    Самара  0.6979316286608328
    Пермь  0.6030275812321798
    Уфа  0.5646080225975854
    Челябинск  0.5524331439673872
    Красноярск  0.5304204580912569
    Киев  0.45981879485440047
    Тула  0.41661455629120664
    Ярославль  0.4096507152070077
    Омск  0.4019762780938088
    Саратов  0.38440086964321135
    Волгоград  0.38034257676647854
    Томск  0.3788266385712788
    Тюмень  0.35250300345254926
    Нур-Султан  0.34241253984075065'''

    data = y.replace('\n', ' ').split()
    x = data[::2][:10]
    y = list(map(float, data[1::2]))[:10]
    fig = 0
    for i in y:
        fig += i
    fig = 100 - fig
    x.append('Остальное')
    y.append(fig)

    # Цветовая палитра в черно-белых тонах
    colors = ['#1f1f1f', '#2f2f2f', '#3f3f3f', '#4f4f4f', '#5f5f5f', '#6f6f6f', '#7f7f7f', '#8f8f8f',
              '#9f9f9f', '#afafaf', '#bfbfbf', '#cfcfcf', '#dfdfdf', '#efefef', '#ffffff']

    # Параметр explode для увеличения расстояния между кусочками
    explode = [0.10] * len(y)

    # Построение круговой диаграммы
    fig, ax = plt.subplots()
    wedges, texts = ax.pie(y, labels=x, colors=colors, explode=explode, textprops=dict(rotation=70, color="black"), labeldistance=1.35)

    # Настройка шрифтов
    for text in texts:
        text.set_fontsize(6)  # Размер шрифта подписей городов

    # Настройка заголовка
    # plt.title("Доля вакансий по городам.", color='white')
    plt.savefig('demand_dolya_vacancy_po_gorodam.png', format='png', dpi=300)
    plt.show()



def third_image():
    y = '''Великобритания  676998.8392857143
    Черногория  335977.2486363636
    Германия  331941.1790909091
    Назрань  300000.0
    Мирный  300000.0
    Батуми  296609.12314285716
    Новый-Уренгой  271666.6666666667
    Турция  268927.87500000006
    Малайзия  264033.5
    Кипр  255771.18394366186
    Онега  250000.0
    Сербия  249172.38365384622
    Тбилиси  248415.14767948724
    Городок  236354.1
    Рожище  236242.0
    Гнивань  236242.0
    Нововолынск  236242.0
    Гайсин  236242.0
    Старая-Выжевка  236242.0
    Турийск  236242.0
    Жмеринка  236242.0
    Вольногорск  236242.0
    Межевая  236242.0
    Зеленодольск  236242.0  
    Иваничи  236242.0
    Ильинцы  236242.0
    Марганец  236242.0
    Маневичи  236242.0
    Владимир-Волынский  236242.0
    Верховцево  236242.0
    Казатин  236242.0
    Калиновка  236242.0
    Магдалиновка  236242.0
    Устилуг  236242.0
    Любомль  236242.0
    Любешов  236242.0
    Каменское  236242.0
    Камень-Каширский  236242.0
    Локачи  236242.0
    Литин  236242.0
    Липовец  236242.0
    Шацк  236242.0
    Киверцы  236242.0
    Ладыжин  236242.0
    Бар  236242.0
    Горохов  236242.0
    Ратно  236242.0
    Бершадь  236242.0
    Берестечко  236242.0
    Крыжополь  236242.0'''
    data = y.replace('\n', ' ').split()
    x = data[::2]
    y = list(map(float, data[1::2]))

    fig, ax = plt.subplots()

    ax.bar(x, y, label='Уровень зарплат', color='black')
    ax.set_xlabel('Города и страны')
    ax.set_ylabel('Уровень зарплат, руб.')
    ax.set_title('Уровень зарплат в различных городах и странах для PHP')
    ax.legend()

    # Изменяем масштаб надписей оси x и уменьшаем шрифт
    plt.xticks(rotation=90, fontsize=5)

    # Устанавливаем деления по оси y
    def y_formatter(x, pos):
        return f'{int(x):,}'.replace(',', ' ')

    ax.yaxis.set_major_formatter(FuncFormatter(y_formatter))
    y_ticks = np.arange(0, max(y) + 30000, 30000)
    plt.yticks(y_ticks, fontsize=6)

    # Сохраняем график в файл
    plt.savefig('demand_uroven_zp_php.png', format='png', dpi=300)

    plt.show()


def four_image():
    y = '''Москва  0.44248025174680294
    Санкт-Петербург  0.19332949295657215
    Минск  0.07516526884532251
    Новосибирск  0.059990095870458025
    Казань  0.03988812376119426
    Екатеринбург  0.03507186178686161
    Киев  0.03238738789952867
    Нижний-Новгород  0.03098198686439554
    Ростов-на-Дону  0.03030297288112897
    Алматы  0.024776114877796435
    Краснодар  0.024681368740596447
    Воронеж  0.022944356225263363
    Самара  0.017685945610664118
    Челябинск  0.016849021398730908
    Омск  0.016738484238664256
    Томск  0.016627947078597608
    Тула  0.014780397403197872
    Уфа  0.012695982384798172
    Пермь  0.012680191361931508
    Ульяновск  0.012143296584464919
    Калининград  0.011527446692665005
    Волгоград  0.011369536463998364
    Красноярск  0.011164253166731725
    Ярославль  0.011006342938065083
    Саратов  0.010027299520331889
    Нур-Султан  0.009600941902931951
    Ташкент  0.00956935985719862
    Барнаул  0.009269330422731998
    Тверь  0.008606107462332094
    Ижевск  0.008163958822065491
    Севастополь  0.007895511433332196
    Пенза  0.007848138364732204
    Тольятти  0.007800765296132209
    Харьков  0.00765864609033223
    Брянск  0.007169124381465635
    Владимир  0.006853303924132346
    Таганрог  0.006774348809799024
    Киров  0.006269036078065764
    Иркутск  0.006237454032332435
    Белгород  0.005937424597865812
    Тюмень  0.005668977209132517
    Владивосток  0.005479484934732544
    Тамбов  0.005337365728932565
    Смоленск  0.005242619591732578
    Рязань  0.00521103754599925
    Иваново  0.005179455500265921
    Йошкар-Ола  0.004974172202999284
    Одесса  0.004800470951465976
    Симферополь  0.00467414276853266
    Липецк  0.004642560722799331'''

    data = y.replace('\n', ' ').split()
    x = data[::2][:10]
    y = list(map(float, data[1::2]))[:10]
    fig = 0
    for i in y:
        fig += i
    fig = 1 - fig
    x.append('Остальное')
    y.append(fig)

    # Цветовая палитра в черно-белых тонах
    colors = ['#1f1f1f', '#2f2f2f', '#3f3f3f', '#4f4f4f', '#5f5f5f', '#6f6f6f', '#7f7f7f', '#8f8f8f',
              '#9f9f9f', '#afafaf', '#bfbfbf', '#cfcfcf', '#dfdfdf', '#efefef', '#ffffff']

    # Параметр explode для увеличения расстояния между кусочками
    explode = [0.10] * len(y)

    # Построение круговой диаграммы
    fig, ax = plt.subplots()
    wedges, texts = ax.pie(y, labels=x, colors=colors, explode=explode, textprops=dict(rotation=0, color="black"),
                           labeldistance=1.35)

    # Настройка шрифтов
    for text in texts:
        text.set_fontsize(6)  # Размер шрифта подписей городов

    # Настройка заголовка
    # plt.title("Доля вакансий по городам.", color='white')
    plt.savefig('demand_dolya_vacancy_po_gorodam_php.png', format='png', dpi=300)
    plt.show()

four_image()