from prettytable import PrettyTable

# Данные
def first_table():
    years = list(range(2003, 2024))  # Годы от 2003 до 2023
    profits = [
        41304.95041859815,
        42967.521860967,
        44939.20745186862,
        41317.917545727556,
        44449.49173313904,
        48411.221444544295,
        44811.747280172036,
        44657.89845349863,
        46448.5237968961,
        47462.016938049615,
        49086.256507791935,
        48552.181058720926,
        51448.03159887236,
        55292.04929364529,
        59512.9022537924,
        64688.60810199752,
        69035.2938600372,
        71944.75619362858,
        82364.2603586067,
        90637.58953238466,
        552428.0880064967
    ]
    profits = list(map(lambda x: f'{float(x):.2f}', profits))

    # Создание таблицы
    table = PrettyTable()
    table.field_names = ["Год", "Зарплата по годам, руб."]

    # Заполнение таблицы данными
    for year, profit in zip(years, profits):
        table.add_row([year, profit])

    # Вывод таблицы
    return table

def second_table():
    years = list(range(2003, 2024))  # Годы от 2003 до 2023
    profits = [
        1983,
        7833,
        16022,
        33321,
        53562,
        75070,
        52889,
        93494,
        142458,
        173897,
        234019,
        259571,
        284763,
        332460,
        391464,
        517670,
        535956,
        611885,
        943151,
        887542,
        683702,
    ]

    # Создание таблицы
    table = PrettyTable()
    table.field_names = ["Год", "Количество вакансий"]

    # Заполнение таблицы данными
    for year, profit in zip(years, profits):
        table.add_row([year, profit])

    # Вывод таблицы
    return table

def third_table():
    years = list(range(2006, 2024))  # Годы от 2003 до 2023
    profits = [
        25223.026,
        55093.99375000001,
        49306.66343750001,
        55972.13555555556,
        54831.61673076923,
        59740.84104265402,
        66139.17851010102,
        67863.71625895755,
        72063.39756321291,
        92168.64332317776,
        112052.65955925119,
        100596.68826548533,
        115901.59692804824,
        125104.25094197413,
        125356.6002400626,
        159894.2306369242,
        183722.74957635996,
        190159.91774707573,
    ]

    profits = list(map(lambda x: f'{float(x):.2f}', profits))
    # Создание таблицы
    table = PrettyTable()
    table.field_names = ["Год", "Зарплата для Python, в руб."]

    # Заполнение таблицы данными
    for year, profit in zip(years, profits):
        table.add_row([year, profit])

    # Вывод таблицы
    return table

def four_table():
    years = list(range(2006, 2024))  # Годы от 2003 до 2023
    profits = [
        5,
        10,
        38,
        60,
        169,
        389,
        714,
        1188,
        4263,
        4146,
        3045,
        3560,
        4863,
        5748,
        7706,
        13044,
        11720,
        10401,
    ]

    # Создание таблицы
    table = PrettyTable()
    table.field_names = ["Год", "Количество вакансий для Python"]

    # Заполнение таблицы данными
    for year, profit in zip(years, profits):
        table.add_row([year, profit])

    # Вывод таблицы
    return table
